БИТУправление_медицинским_центром_демо/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияСотрудникам</registerRecords>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьФиксированныеНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСдельныеНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьПервичныеНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВторичныеНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаОтбораСотрудников</name>
    <comment>Хранилище значений, в котором хранится настройка отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоОдномуФилиалу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БазаРасчета</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель1</name>
      <type>
        <types>CatalogRef.ВидыГрафиков</types>
        <types>CatalogRef.ПараметрыРасчетаЗП</types>
        <types>ChartOfCalculationTypesRef.Начисления</types>
        <types>CatalogRef.Филиалы</types>
        <types>CatalogRef.КатегорииВыработки</types>
        <types>Number</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ШкалыРасчета</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель2</name>
      <type>
        <types>CatalogRef.ВидыГрафиков</types>
        <types>CatalogRef.ПараметрыРасчетаЗП</types>
        <types>ChartOfCalculationTypesRef.Начисления</types>
        <types>CatalogRef.Филиалы</types>
        <types>CatalogRef.КатегорииВыработки</types>
        <types>Number</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ШкалыРасчета</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель3</name>
      <type>
        <types>CatalogRef.ВидыГрафиков</types>
        <types>CatalogRef.ПараметрыРасчетаЗП</types>
        <types>ChartOfCalculationTypesRef.Начисления</types>
        <types>CatalogRef.Филиалы</types>
        <types>CatalogRef.КатегорииВыработки</types>
        <types>Number</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ШкалыРасчета</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияВыработки</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрудоваяРоль</name>
      <type>
        <types>CatalogRef.ТрудовыеРоли</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияВыработки</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияВыработки</name>
      <type>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ВзаиморасчетыССотрудниками/ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОперацийРКО/ВидыОперацийРКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРКО</name>
  <enumValues>
    <name>РасчетыСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствСотруднику</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентами</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВзносНаличнымиВБанк</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/ВедомостьОВыплаченнойЗарплатеЧерезБанк/ВедомостьОВыплаченнойЗарплатеЧерезБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОВыплаченнойЗарплатеЧерезБанк</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетыССотрудниками</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/НачислениеЗарплаты/Forms/ФормаВыплаты/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументНачисления = Параметры.Документ;
	
	
	Если ЗначениеЗаполнено(ДокументНачисления) Тогда
		СпособСуммыВыплаты = РаботаСФормамиСервер.ПолучитьНастройкуФормы("НачислениеЗарплаты.ФормаВыплаты", "СпособСуммыВыплаты", 0);
	Иначе
		СпособСуммыВыплаты = 1; // Задолженность;
	КонецЕсли;
	
	Если Параметры.Сотрудники <> Неопределено Тогда
		ЗаполнитьФормуСпискомСотрудников(Параметры.Сотрудники);
	Иначе
		ЗаполнитьВсемиСотрудниками();
	КонецЕсли;
	
	НастроитьФормуПоРежимуОткрытия();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СпособСуммыВыплатыПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументНачисления) Тогда
		РаботаСФормамиСервер.СохранитьНастройкуФормы("НачислениеЗарплаты.ФормаВыплаты", "СпособСуммыВыплаты", СпособСуммыВыплаты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "РКОЗаписан"
		И Параметр.Свойство("Получатель")
		И ТаблицаВыплат.НайтиСтроки(Новый Структура("Сотрудник", Параметр.Получатель)).Количество() <> 0
	Тогда
		Сотрудники = Новый Массив;
		Сотрудники.Добавить(Параметр.Получатель);
		ЗаполнитьФормуСпискомСотрудников(Сотрудники);
	ИначеЕсли ИмяСобытия = "БанковскаяВедомостьЗПЗаполнена" Тогда
		ЗаполнитьФормуСпискомСотрудников(Источник);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособСуммыВыплатыПриИзменении(Элемент)
	
	Для Каждого Строка Из ТаблицаВыплат Цикл
		
		Если СпособСуммыВыплаты = 0 Тогда
			Выплатить = Строка.Начислено;
		ИначеЕсли СпособСуммыВыплаты = 1 Тогда
			Выплатить = Строка.Задолженность;
		Иначе
			Выплатить = Мин(Строка.Начислено, Строка.Задолженность);
		КонецЕсли;
			
		Строка.Выплатить = Выплатить;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КомандаСоздатьРКО(Команда)
	
	Данные = Элементы.ТаблицаВыплат.ТекущиеДанные;
	
	Если Данные <> Неопределено Тогда
		ЗначенияЗаполнения = Новый Структура("Контрагент, СуммаДокумента, ВидОперации", Данные.Сотрудник, Данные.Выплатить, ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствСотруднику"));
		ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	    ОткрытьФорму("Документ.РасходныйКассовыйОрдер.ФормаОбъекта", ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыплатаЧерезБанк(Команда)
	
    ЗначенияЗаполнения = Новый Структура("Выплаты", ТаблицуВыплатВМассив(ТаблицаВыплат));
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ВедомостьОВыплаченнойЗарплатеЧерезБанк.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоРежимуОткрытия()
	
	Если Не ЗначениеЗаполнено(ДокументНачисления) Тогда
		Элементы.СпособСуммыВыплаты.Видимость = Ложь;
		Элементы.ТаблицаВыплатСумма.Видимость = Ложь; // Колонка Начислено.
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуСпискомСотрудников(Сотрудники)
	
	Если ТипЗнч(Сотрудники) = Тип("ДокументСсылка.ВедомостьОВыплаченнойЗарплатеЧерезБанк") Тогда
		Сотрудники = Сотрудники.РасчетыССотрудниками.Выгрузить().ВыгрузитьКолонку("Сотрудник");
	КонецЕсли;
	
	Для Каждого Сотрудник Из Сотрудники Цикл
		
		СтрокиСотрудника = ТаблицаВыплат.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
		Если СтрокиСотрудника.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаВыплат.Добавить();
			НоваяСтрока.Сотрудник = Сотрудник;
		Иначе
			НоваяСтрока = СтрокиСотрудника[0];
		КонецЕсли;
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Регистратор", ДокументНачисления);
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВзаиморасчетыССотрудниками.Сумма) КАК Сумма,
		|	ВзаиморасчетыССотрудниками.Сотрудник
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
		|ГДЕ
		|	ВзаиморасчетыССотрудниками.Регистратор = &Регистратор
		|	И ВзаиморасчетыССотрудниками.Сотрудник = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыССотрудниками.Сотрудник";
		
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		Если Выгрузка.Количество() = 0 Тогда
			
			НоваяСтрока.Начислено = 0;
			
		Иначе
			
			НоваяСтрока.Начислено = Выгрузка[0].Сумма;	
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки КАК ВзаиморасчетыССотрудникамиОстатки
		|ГДЕ
		|	ВзаиморасчетыССотрудникамиОстатки.Сотрудник = &Сотрудник";
		
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		Если Выгрузка.Количество() = 0 Тогда
			
			НоваяСтрока.Задолженность = 0;
			
		Иначе
			
			НоваяСтрока.Задолженность = Выгрузка[0].Сумма;	
			
		КонецЕсли;
		
		НоваяСтрока.Выплатить = НоваяСтрока.Начислено;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсемиСотрудниками()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.СуммаОстаток КАК Задолженность,
	|	Остатки.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки КАК Остатки
	|ГДЕ
	|	Остатки.СуммаОстаток > 0 
	|	И НЕ Остатки.Сотрудник.Архив
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.Сотрудник.Наименование";
	
	ОстаткиРасчетов = Запрос.Выполнить().Выбрать();
	Пока ОстаткиРасчетов.Следующий() Цикл
	
		НоваяСтрока = ТаблицаВыплат.Добавить();
		НоваяСтрока.Сотрудник	  = ОстаткиРасчетов.Сотрудник;
		НоваяСтрока.Задолженность = ОстаткиРасчетов.Задолженность;
		НоваяСтрока.Выплатить	  = НоваяСтрока.Задолженность;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицуВыплатВМассив(Знач ТаблицаВыплат)
	
	Выплаты = ТаблицаВыплат.Выгрузить();
	Выплаты.Колонки.Выплатить.Имя = "Сумма";
	Выплаты.Свернуть("Сотрудник", "Сумма");
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Выплаты);
	
КонецФункции

#КонецОбласти
